In [33]:
import pandas as pd

df1 = pd.read_csv('steps.csv', delimiter=';')
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 929 entries, 0 to 928
Columns: 329 entries, id to 13-5-2014
dtypes: float64(328), int64(1)
memory usage: 2.3 MB

In [34]:
df2 = pd.read_csv('survey.csv')
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 929 entries, 0 to 928
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           929 non-null    int64
 1   city         929 non-null    object
 2   gender       929 non-null    object
 3   age          929 non-null    object
 4   hh_size      929 non-null    int64
 5   education    929 non-null    int64
 6   education_1  929 non-null    object
 7   height       928 non-null    float64
 8   weight       927 non-null    float64
dtypes: float64(2), int64(3), object(4)
memory usage: 65.4+ KB

In [35]:
df3 = pd.merge(df2, df1, on='id')
df3.head()

,id,city,gender,age,hh_size,education,education_1,height,weight,20-6-2013,...,4-5-2014,5-5-2014,6-5-2014,7-5-2014,8-5-2014,9-5-2014,10-5-2014,11-5-2014,12-5-2014,13-5-2014
0,1,Bordeaux,Male,25-34,4,4,Master or doctorate,178.0,98.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2,Lille,Male,35-44,1,3,Bachelor,180.0,77.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,3,Montpellier,Male,25-34,2,2,Master or doctorate,180.0,83.0,NaN,...,3914.0,4364.0,NaN,NaN,NaN,6227.0,4567.0,2567.0,1129.0,NaN
3,4,Lyon,Male,<25,1,1,Bachelor,178.0,80.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5,Montpellier,Female,25-34,3,4,Bachelor,167.0,61.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [36]:
df4 = df3.fillna(0)
df4.head()

,id,city,gender,age,hh_size,education,education_1,height,weight,20-6-2013,...,4-5-2014,5-5-2014,6-5-2014,7-5-2014,8-5-2014,9-5-2014,10-5-2014,11-5-2014,12-5-2014,13-5-2014
0,1,Bordeaux,Male,25-34,4,4,Master or doctorate,178.0,98.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Lille,Male,35-44,1,3,Bachelor,180.0,77.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Montpellier,Male,25-34,2,2,Master or doctorate,180.0,83.0,0.0,...,3914.0,4364.0,0.0,0.0,0.0,6227.0,4567.0,2567.0,1129.0,0.0
3,4,Lyon,Male,<25,1,1,Bachelor,178.0,80.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,5,Montpellier,Female,25-34,3,4,Bachelor,167.0,61.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [37]:
result = df4.loc[:, '20-6-2013':'13-5-2014']
print(result)

     20-6-2013  21-6-2013  22-6-2013  23-6-2013  24-6-2013  25-6-2013  \
0          0.0        0.0        0.0        0.0     3941.0    15733.0
1          0.0        0.0    10473.0      705.0     4287.0     5507.0
2          0.0    11428.0    12523.0     2553.0      190.0     2164.0
3          0.0        0.0        0.0        0.0        0.0        0.0
4          0.0        0.0        0.0        0.0        0.0        0.0
..         ...        ...        ...        ...        ...        ...
924        0.0     4571.0    10471.0     5899.0    15295.0     9178.0
925        0.0        0.0        0.0        0.0        0.0        0.0
926        0.0        0.0        0.0     1623.0        0.0        0.0
927        0.0        0.0    14411.0    14364.0    26629.0    13092.0
928        0.0     3324.0     4507.0    14364.0     4098.0     7299.0

     26-6-2013  27-6-2013  28-6-2013  29-6-2013  ...  4-5-2014  5-5-2014  \
0       9929.0    12879.0    10541.0    15773.0  ...       0.0       0.0
1       4024.0     3926.0    14595.0     2952.0  ...       0.0       0.0
2       8185.0     9630.0     8983.0     5700.0  ...    3914.0    4364.0
3          0.0        0.0        0.0        0.0  ...       0.0       0.0
4          0.0        0.0        0.0        0.0  ...       0.0       0.0
..         ...        ...        ...        ...  ...       ...       ...
924     9348.0    12229.0    13767.0        0.0  ...       0.0       0.0
925        0.0        0.0        0.0        0.0  ...       0.0       0.0
926        0.0        0.0        0.0        0.0  ...       0.0       0.0
927     9266.0    14949.0    43238.0        6.0  ...       0.0       0.0
928    11534.0    10125.0     7700.0     8459.0  ...       0.0       0.0

     6-5-2014  7-5-2014  8-5-2014  9-5-2014  10-5-2014  11-5-2014  12-5-2014  \
0         0.0       0.0       0.0       0.0        0.0        0.0        0.0
1         0.0       0.0       0.0       0.0        0.0        0.0        0.0
2         0.0       0.0       0.0    6227.0     4567.0     2567.0     1129.0
3         0.0       0.0       0.0       0.0        0.0        0.0        0.0
4         0.0       0.0       0.0       0.0        0.0        0.0        0.0
..        ...       ...       ...       ...        ...        ...        ...
924       0.0       0.0       0.0       0.0        0.0        0.0        0.0
925       0.0       0.0       0.0       0.0        0.0        0.0        0.0
926       0.0       0.0       0.0       0.0        0.0        0.0        0.0
927       0.0       0.0       0.0       0.0        0.0        0.0        0.0
928       0.0       0.0       0.0       0.0        0.0        0.0        0.0

     13-5-2014
0          0.0
1          0.0
2          0.0
3          0.0
4          0.0
..         ...
924        0.0
925        0.0
926        0.0
927        0.0
928        0.0

[929 rows x 328 columns]

In [38]:
df4['mean_steps'] = result.mean(axis=1)
df4.head()

,id,city,gender,age,hh_size,education,education_1,height,weight,20-6-2013,...,5-5-2014,6-5-2014,7-5-2014,8-5-2014,9-5-2014,10-5-2014,11-5-2014,12-5-2014,13-5-2014,mean_steps
0,1,Bordeaux,Male,25-34,4,4,Master or doctorate,178.0,98.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,5133.875000
1,2,Lille,Male,35-44,1,3,Bachelor,180.0,77.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,2826.371951
2,3,Montpellier,Male,25-34,2,2,Master or doctorate,180.0,83.0,0.0,...,4364.0,0.0,0.0,0.0,6227.0,4567.0,2567.0,1129.0,0.0,3745.902439
3,4,Lyon,Male,<25,1,1,Bachelor,178.0,80.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,221.536585
4,5,Montpellier,Female,25-34,3,4,Bachelor,167.0,61.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,874.557927